[
    {
      "id": 1,
      "name": "GymBro",
      "unique": "gym",
      "imageSized": "./img/GymBroSized.png",
      "image": "./img/GymBro.png",
      "description": "GymBro is a browser based workout generator that allows you to pick certain criteria such as legs, arms, chest, etc, to generate a workout. Other selectors include workout intensity. In addition to providing you with a great workout we have also provided the user with the option to choose a music playlist to accompany the workout, using Spotify. Users can even save their last workout to LocalStorage and recall it as long keep their browser open!",
      "gitHub": "https://github.com/dan-gentile/gym-bro",
      "deployed": "https://dan-gentile.github.io/gym-bro/"
    },
    {
      "id": 2,
      "name": "Weather Dashboard",
      "unique": "dash",
      "imageSized": "./img/dashboardExampleSized.PNG",
      "image": "./img/dashboardExample.PNG",
      "description": "Utilizing the free OpenWeather API, this application retrieves weather data for cities for the current day, as well as a five-day forecast. The last ten searched cities are saved in local storage and displayed on the screen so the user can easily check a previously searched city.",
      "gitHub": "https://github.com/virlym/hw6-weather-forecast",
      "deployed": "https://virlym.github.io/hw6-weather-forecast/"
    },
    {
      "id": 3,
      "name": "Password Generator",
      "unique": "pass",
      "imageSized": "./img/passwordGeneratorSized.PNG",
      "image": "./img/passwordGenerator.PNG",
      "description": "Utilizing existing HTML and CSS, javascript code was written to generate a password based on user inputs. When the user presses the generate password button, they will be prompted with a series of questions. A password is then constructed using random values of the selected inputs until it is the desired length.",
      "gitHub": "https://github.com/virlym/hw3-password-generator",
      "deployed": "https://virlym.github.io/hw3-password-generator/"
    },
    {
      "id": 4,
      "name": "The Cold West",
      "unique": "tcw",
      "imageSized": "./img/tcwHomePageSized.png",
      "image": "./img/tcwHomePage.png",
      "description": "The Cold West is a web app that allows the user to get detailed information on ten of Washington's ski resorts and some activities they have. There is an option to create an account that will allow the user to save a favorite resort and activity. By saving a favorite, that will move quick access links to the user's dashboard for more direct access to the info page in the app as well as the resort's own home page.",
      "gitHub": "https://github.com/kbnewlon/Cold-West-Tours",
      "deployed": "https://the-cold-west.herokuapp.com/"
    }
]